<?php

return [

    'materials' => [
        1 => 'Натуральное дерево',
        2 => 'Пластик',
        3 => 'МДФ пленка',
        4 => 'ДСП',
        5 => 'МДФ эмаль',
        6 => 'Акрил',
        7 => 'Натуральный шпон',
    ],

    'furniture_types' => [
        1 => ['name' => 'П-образный', 'img' => 'furniture-type-p.png'],
        2 => ['name' => 'Г-образный слева', 'img' => 'furniture-type-left.png'],
        3 => ['name' => 'Г-образный справа', 'img' => 'furniture-type-right.png'],
        4 => ['name' => 'Прямой', 'img' => 'furniture-type-top.png'],
    ],

    'cupboard_height' => [
        1 => '72 см.',
        2 => '74 см.',
        3 => '76 см.',
        4 => '78 см.',
        5 => '80 см.',
    ],

    'equipment' => [
        1 => 'Варочная поверхность',
        2 => 'Вытяжка',
        3 => 'Духовой шкаф',
        4 => 'Посудомоечная машина',
        5 => 'Стиральная машина',
        6 => 'Холодильник',
        7 => 'Стеновая панель',
    ],

];
