<?php

return [

    'material' => [
        1 => 'Натуральное дерево',
        2 => 'Пластик',
        3 => 'МДФ пленка',
        4 => 'ДСП',
        5 => 'МДФ эмаль',
        6 => 'Акрил',
        7 => 'Натуральный шпон',
    ],

    'furniture_type' => [
        1 => ['name' => 'П-образный', 'img' => 'furniture-type-p.png'],
        2 => ['name' => 'Г-образный слева', 'img' => 'furniture-type-left.png'],
        3 => ['name' => 'Г-образный справа', 'img' => 'furniture-type-right.png'],
        4 => ['name' => 'Прямой', 'img' => 'furniture-type-top.png'],
    ],

    'equipment' => [
        1 => 'Варочная поверхность',
        2 => 'Вытяжка',
        3 => 'Духовой шкаф',
        4 => 'Посудомоечная машина',
        5 => 'Стиральная машина',
        6 => 'Холодильник',
        7 => 'Стеновая панель',
    ],

    'price_type' => [
        0 => '-',
        1 => 'за погонный метр',
        2 => 'за квадрытный метр',
        3 => 'за штуку',
    ],

    'properties' => [
        'style' => 'Стиль',
        'material' => 'Материал',
        'price' => 'Стоимость',
        'equipment' => 'Комплектация',
        'size' => 'Размер',
        'color' => 'Цвет',
        'purpose' => 'Назначение',
        'type' => 'Тип мебели',
        'kind' => 'Вид мебели',
        'doors' => 'Кол-во дверей',
    ]

];
